[
{"url": "https://books.toscrape.com/catalogue/a-light-in-the-attic_1000/index.html", "title": "A Light in the Attic", "upc": "a", "product_type": "books", "price_excl_tax": 51.77, "price_incl_tax": 51.77, "tax": 0.0, "availability": 22, "num_reviews": 0, "stars": "star-rating Three", "category": "poetry", "description": ["It's hard to imagine a world without A Light in the Attic. This now-classic collection of poetry and drawings from Shel Silverstein celebrates its 20th anniversary with this special edition. Silverstein's humorous and creative verse can amuse the dowdiest of readers. Lemon-faced adults and fidgety kids sit still and read these rhythmic words and laugh and smile and love th It's hard to imagine a world without A Light in the Attic. This now-classic collection of poetry and drawings from Shel Silverstein celebrates its 20th anniversary with this special edition. Silverstein's humorous and creative verse can amuse the dowdiest of readers. Lemon-faced adults and fidgety kids sit still and read these rhythmic words and laugh and smile and love that Silverstein. Need proof of his genius? RockabyeRockabye baby, in the treetopDon't you know a treetopIs no safe place to rock?And who put you up there,And your cradle, too?Baby, I think someone down here'sGot it in for you. Shel, you never sounded so good. ...more"], "price": 51.77},
{"url": "https://books.toscrape.com/catalogue/in-her-wake_980/index.html", "title": "In Her Wake", "upc": "2", "product_type": "books", "price_excl_tax": 12.84, "price_incl_tax": 12.84, "tax": 0.0, "availability": 19, "num_reviews": 0, "stars": "star-rating One", "category": "thriller", "description": ["A perfect life … until she discovered it wasn’t her own.A tragic family event reveals devastating news that rips apart Bella’s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten n A perfect life … until she discovered it wasn’t her own.A tragic family event reveals devastating news that rips apart Bella’s comfortable existence. Embarking on a personal journey to uncover the truth, she faces a series of traumatic discoveries that take her to the ruggedly beautiful Cornish coast, where hidden truths, past betrayals and a 25-year-old mystery threaten not just her identity, but also her life.Chilling, complex and profoundly moving, In Her Wake is a gripping psychological thriller that questions the nature of family – and reminds us that sometimes the most shocking crimes are committed closest to home. ...more"], "price": 12.84},
{"url": "https://books.toscrape.com/catalogue/slow-states-of-collapse-poems_960/index.html", "title": "Slow States of Collapse: Poems", "upc": "b", "product_type": "books", "price_excl_tax": 57.31, "price_incl_tax": 57.31, "tax": 0.0, "availability": 17, "num_reviews": 0, "stars": "star-rating Three", "category": "poetry", "description": ["The eagerly anticipated debut from one of Canada’s most exciting new poets In her debut collection, Ashley-Elizabeth Best explores the cultivation of resilience during uncertain and often trying times. It’s a book built around day-to-day conflicts — poems about love, family, grief, power, and longing. Navigating the fault lines of popular culture and traditional poetry to The eagerly anticipated debut from one of Canada’s most exciting new poets In her debut collection, Ashley-Elizabeth Best explores the cultivation of resilience during uncertain and often trying times. It’s a book built around day-to-day conflicts — poems about love, family, grief, power, and longing. Navigating the fault lines of popular culture and traditional poetry to assert that we are all history makers, Slow States of Collapse enters the landscape of personal narrative in an attempt to reconcile life’s little universal griefs.Slow States of Collapse presents a world that is at once menacing and full of wonder and grace. It’s a poetry of “casual cruelty” and “kisses like / puncture wounds,” of “something too tender to touch” and “the threat of an intense beauty.” In this collection, illness confronts bedside manners while a migrant restlessness also paints remarkable portraits of shifting self-image, and in the process the nature of personal and political power is reimagined. ...more"], "price": 57.31},
{"url": "https://books.toscrape.com/catalogue/the-nameless-city-the-nameless-city-1_940/index.html", "title": "The Nameless City (The Nameless City #1)", "upc": "7", "product_type": "books", "price_excl_tax": 38.16, "price_incl_tax": 38.16, "tax": 0.0, "availability": 16, "num_reviews": 0, "stars": "star-rating Four", "category": "sequential art", "description": ["Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occu Every nation that invades the City gives it a new name. But before long, new invaders arrive and the City changes hands once again. The natives don't let themselves get caught up in the unending wars. To them, their home is the Nameless City, and those who try to name it are forever outsiders.Kaidu is one such outsider. He's a Dao born and bred--a member of the latest occupying nation. Rat is a native of the Nameless City. At first, she hates Kai for everything he stands for, but his love of his new home may be the one thing that can bring these two unlikely friends together. Let's hope so, because the fate of the Nameless City rests in their hands. ...more"], "price": 38.16},
{"url": "https://books.toscrape.com/catalogue/princess-jellyfish-2-in-1-omnibus-vol-01-princess-jellyfish-2-in-1-omnibus-1_920/index.html", "title": "Princess Jellyfish 2-in-1 Omnibus, Vol. 01 (Princess Jellyfish 2-in-1 Omnibus #1)", "upc": "0", "product_type": "books", "price_excl_tax": 13.61, "price_incl_tax": 13.61, "tax": 0.0, "availability": 16, "num_reviews": 0, "stars": "star-rating Five", "category": "sequential art", "description": ["THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way. THE LONG-AWAITED STORY OF FANGIRLS TAKING ON TOKYO!Special large-size 2-in-1 edition of over 400 pages!\"One of the best anime and manga for beginners. Enthusiasm - geeky and otherwise - is power in Princess Jellyfish. Enthusiasm saves the day and paves the road to the future.\" - Kotaku\"Princess Jellyfish's ambition is simple: to tell a delightful story in a delightful way... It's a pretty deadly one-two punch.\" - Anime News Network\"Loaded with heart, soul, humor and insight.\" - About.comSTINGING BEAUTY Tsukimi Kurashita has a strange fascination with jellyfish. She’s loved them from a young age and has carried that love with her to her new life in the big city of Tokyo. There, she resides in Amamizukan, a safe-haven for girl geeks who regularly gush over a range of things from trains to Japanese dolls. However, a chance meeting at a pet shop has Tsukimi crossing paths with one of the things that the residents of Amamizukan have been desperately trying to avoid—a beautiful and fashionable woman! But there’s much more to this woman than her trendy clothes! This odd encounter is only the beginning of a new and unexpected path for Tsukimi and her friends. ...more"], "price": 13.61},
{"url": "https://books.toscrape.com/catalogue/immunity-how-elie-metchnikoff-changed-the-course-of-modern-medicine_900/index.html", "title": "Immunity: How Elie Metchnikoff Changed the Course of Modern Medicine", "upc": "e", "product_type": "books", "price_excl_tax": 57.36, "price_incl_tax": 57.36, "tax": 0.0, "availability": 16, "num_reviews": 0, "stars": "star-rating Five", "category": "science", "description": ["Around Christmas of 1882, while peering through a microscope at starfish larvae in which he had inserted tiny thorns, Russian zoologist Elie Metchnikoff had a brilliant insight: what if the mobile cells he saw gathering around the thorns were nothing but a healing force in action? Metchnikoff’s daring theory of immunity—that voracious cells he called phagocytes formed the Around Christmas of 1882, while peering through a microscope at starfish larvae in which he had inserted tiny thorns, Russian zoologist Elie Metchnikoff had a brilliant insight: what if the mobile cells he saw gathering around the thorns were nothing but a healing force in action? Metchnikoff’s daring theory of immunity—that voracious cells he called phagocytes formed the first line of defense against invading bacteria—would eventually earn the scientist a Nobel Prize, shared with his archrival, as well as the unofficial m oniker “Father of Natural Immunity.” But first he had to win over skeptics, especially those who called his theory “an oriental fairy tale.” Using previously inaccessible archival materials, author Luba Vikhanski chronicles Metchnikoff’s remarkable life and discoveries in the first moder n biography of this hero of medicine. Metchnikoff was a towering figure in the scientific community of the early twentieth century, a tireless humanitarian who, while working at the Pasteur Institute in Paris, also strived to curb the spread of cholera, syphilis, and other deadly diseases. In his later years, he startled the world with controversial theories on longevity, launching a global craze for yogurt, and pioneered research into gut microbes and aging. Though Metchnikoff was largely forgotten for nearly a hundred years, Vikhanski documents a remarkable revival of interest in his ideas on immunity and on the gut flora in the science of the twenty-first century. ...more"], "price": 57.36},
{"url": "https://books.toscrape.com/catalogue/algorithms-to-live-by-the-computer-science-of-human-decisions_880/index.html", "title": "Algorithms to Live By: The Computer Science of Human Decisions", "upc": "3", "product_type": "books", "price_excl_tax": 30.81, "price_incl_tax": 30.81, "tax": 0.0, "availability": 16, "num_reviews": 0, "stars": "star-rating One", "category": "nonfiction", "description": ["A fascinating exploration of how insights from computer algorithms can be applied to our everyday lives, helping to solve common decision-making problems and illuminate the workings of the human mindAll our lives are constrained by limited space and time, limits that give rise to a particular set of problems. What should we do, or leave undone, in a day or a lifetime? How A fascinating exploration of how insights from computer algorithms can be applied to our everyday lives, helping to solve common decision-making problems and illuminate the workings of the human mindAll our lives are constrained by limited space and time, limits that give rise to a particular set of problems. What should we do, or leave undone, in a day or a lifetime? How much messiness should we accept? What balance of new activities and familiar favorites is the most fulfilling? These may seem like uniquely human quandaries, but they are not: computers, too, face the same constraints, so computer scientists have been grappling with their version of such issues for decades. And the solutions they've found have much to teach us.In a dazzlingly interdisciplinary work, acclaimed author Brian Christian and cognitive scientist Tom Griffiths show how the algorithms used by computers can also untangle very human questions. They explain how to have better hunches and when to leave things to chance, how to deal with overwhelming choices and how best to connect with others. From finding a spouse to finding a parking spot, from organizing one's inbox to understanding the workings of memory, Algorithms to Live By transforms the wisdom of computer science into strategies for human living. ...more"], "price": 30.81},
{"url": "https://books.toscrape.com/catalogue/the-shadow-hero-the-shadow-hero_860/index.html", "title": "The Shadow Hero (The Shadow Hero)", "upc": "d", "product_type": "books", "price_excl_tax": 33.14, "price_incl_tax": 33.14, "tax": 0.0, "availability": 15, "num_reviews": 0, "stars": "star-rating One", "category": "sequential art", "description": ["A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. The Shadow Hero is based on golden-age comic series The Green Turtle, whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American su A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. The Shadow Hero is based on golden-age comic series The Green Turtle, whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American superhero.Now, exactly seventy years later, New York Times-bestselling author Gene Luen Yang has revived this nearly forgotten, pioneering character in a new graphic novel that creates an origin story for the golden-age Green Turtle. With artwork by the unmatched Sonny Liew, this hilarious and insightful graphic novel about heroism and heritage is also a loving tribute to the long, rich tradition of American superhero comics. ...more"], "price": 33.14},
{"url": "https://books.toscrape.com/catalogue/the-bridge-to-consciousness-im-writing-the-bridge-between-science-and-our-old-and-new-beliefs_840/index.html", "title": "The Bridge to Consciousness: I'm Writing the Bridge Between Science and Our Old and New Beliefs.", "upc": "e", "product_type": "books", "price_excl_tax": 32.0, "price_incl_tax": 32.0, "tax": 0.0, "availability": 15, "num_reviews": 0, "stars": "star-rating Three", "category": "default", "description": [null], "price": 32.0},
{"url": "https://books.toscrape.com/catalogue/modern-romance_820/index.html", "title": "Modern Romance", "upc": "c", "product_type": "books", "price_excl_tax": 28.26, "price_incl_tax": 28.26, "tax": 0.0, "availability": 15, "num_reviews": 0, "stars": "star-rating Five", "category": "add a comment", "description": ["Now a New York Times BestsellerA hilarious, thoughtful, and in-depth exploration of thepleasures and perils of modern romance from one of this generation’s sharpest comedic voicesAt some point, every one of us embarks on a journey to find love. We meet people, date, getinto and out of relationships, all with the hopeof finding someone with whom we share a deepconnection. T Now a New York Times BestsellerA hilarious, thoughtful, and in-depth exploration of the pleasures and perils of modern romance from one of this generation’s sharpest comedic voicesAt some point, every one of us embarks on a journey to find love. We meet people, date, get into and out of relationships, all with the hope of finding someone with whom we share a deep connection. This seems standard now, but it’s wildly different from what people did even just decades ago. Single people today have more romantic options than at any point in human history. With technology, our abilities to connect with and sort through these options are staggering. So why are so many people frustrated?Some of our problems are unique to our time. “Why did this guy just text me an emoji of a pizza?” “Should I go out with this girl even though she listed Combos as one of her favorite snack foods? Combos?!” “My girlfriend just got a message from some dude named Nathan. Who’s Nathan? Did he just send her a photo of his penis? Should I check just to be sure?” But the transformation of our romantic lives can’t be explained by technology alone. In a short period of time, the whole culture of finding love has changed dramatically. A few decades ago, people would find a decent person who lived in their neighborhood. Their families would meet and, after deciding neither party seemed like a murderer, they would get married and soon have a kid, all by the time they were twenty-four. Today, people marry later than ever and spend years of their lives on a quest to find the perfect person, a soul mate.For years, Aziz Ansari has been aiming his comic insight at modern romance, but for Modern Romance, the book, he decided he needed to take things to another level. He teamed up with NYU sociologist Eric Klinenberg and designed a massive research project, including hundreds of interviews and focus groups conducted everywhere from Tokyo to Buenos Aires to Wichita. They analyzed behavioral data and surveys and created their own online research forum on Reddit, which drew thousands of messages. They enlisted the world’s leading social scientists, including Andrew Cherlin, Eli Finkel, Helen Fisher, Sheena Iyengar, Barry Schwartz, Sherry Turkle, and Robb Willer. The result is unlike any social science or humor book we’ve seen before.In Modern Romance, Ansari combines his irreverent humor with cutting-edge social science to give us an unforgettable tour of our new romantic world. ...more"], "price": 28.26},
{"url": "https://books.toscrape.com/catalogue/dark-notes_800/index.html", "title": "Dark Notes", "upc": "8", "product_type": "books", "price_excl_tax": 19.19, "price_incl_tax": 19.19, "tax": 0.0, "availability": 15, "num_reviews": 0, "stars": "star-rating Five", "category": "erotica", "description": ["They call me a slut. Maybe I am.Sometimes I do things I despise.Sometimes men take without asking.But I have a musical gift, only a year left of high school, and a plan.With one obstacle.Emeric Marceaux doesn’t just take.He seizes my will power and bangs it like a dark note.When he commands me to play, I want to give him everything.I kneel for his punishments, tremble for They call me a slut. Maybe I am.Sometimes I do things I despise.Sometimes men take without asking.But I have a musical gift, only a year left of high school, and a plan.With one obstacle.Emeric Marceaux doesn’t just take.He seizes my will power and bangs it like a dark note.When he commands me to play, I want to give him everything.I kneel for his punishments, tremble for his touch, and risk it all for our stolen moments.He’s my obsession, my master, my music.And my teacher. ...more"], "price": 19.19},
{"url": "https://books.toscrape.com/catalogue/whole-lotta-creativity-going-on-60-fun-and-unusual-exercises-to-awaken-and-strengthen-your-creativity_780/index.html", "title": "Whole Lotta Creativity Going On: 60 Fun and Unusual Exercises to Awaken and Strengthen Your Creativity", "upc": "4", "product_type": "books", "price_excl_tax": 38.2, "price_incl_tax": 38.2, "tax": 0.0, "availability": 14, "num_reviews": 0, "stars": "star-rating Four", "category": "nonfiction", "description": ["Be your own kind of creative. Everyone has a creative core. Everyone! But, in order for it to thrive, it needs to be nurtured. That's where \"Whole Lotta Creativity Going On\" can help. It's not a crafts or how-to book, but rather a fun book, filled with 10 different types of unusual and thought-provoking activities and exercises, which can be used to ignite and invigorate y Be your own kind of creative. Everyone has a creative core. Everyone! But, in order for it to thrive, it needs to be nurtured. That's where \"Whole Lotta Creativity Going On\" can help. It's not a crafts or how-to book, but rather a fun book, filled with 10 different types of unusual and thought-provoking activities and exercises, which can be used to ignite and invigorate your creative spark. Sometimes, those that don't feel they are creative, surprise themselves the most when they unlock the door, clear away the dust, and begin to discover and unleash the creative side of themselves. For others, perhaps, their creative spirit hasn't been given enough of an opportunity to really flourish and express itself in its own unique way.This book contains 60 different creativity stretchers to get you going which are grouped into the following categories: - Awareness, Sensory, and Experience - Creativity in Action- Ideation- Imagination- Pictures, Patterns, and Abstractions- Snap Portraits- Snap Solutions- Stop and Reflect- Thought Expression- Word Play ...more"], "price": 38.2},
{"url": "https://books.toscrape.com/catalogue/the-power-of-habit-why-we-do-what-we-do-in-life-and-business_760/index.html", "title": "The Power of Habit: Why We Do What We Do in Life and Business", "upc": "6", "product_type": "books", "price_excl_tax": 16.88, "price_incl_tax": 16.88, "tax": 0.0, "availability": 14, "num_reviews": 0, "stars": "star-rating Three", "category": "default", "description": ["A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figur A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed. Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year. An untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones. What do all these people have in common? They achieved success by focusing on the patterns that shape every aspect of our lives.  They succeeded by transforming habits. In The Power of Habit, award-winning New York Times business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation.  Along the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren’s Saddleback Church, NFL locker rooms, and the nation’s largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death. At its core, The Power of Habit contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work.  Habits aren’t destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives. ...more"], "price": 16.88},
{"url": "https://books.toscrape.com/catalogue/swell-a-year-of-waves_740/index.html", "title": "Swell: A Year of Waves", "upc": "4", "product_type": "books", "price_excl_tax": 45.58, "price_incl_tax": 45.58, "tax": 0.0, "availability": 14, "num_reviews": 0, "stars": "star-rating One", "category": "nonfiction", "description": ["Wave watchers around the world know that no two waves are the same. Yet each and every wave that rises, peaks, and crashes onto the beach is generated by a much larger force originating thousands of miles away. Surf journalist team Evan Slater and Peter Taras capture the essence of waves and the swells that produce them in this breathtaking collection of wave photography. Wave watchers around the world know that no two waves are the same. Yet each and every wave that rises, peaks, and crashes onto the beach is generated by a much larger force originating thousands of miles away. Surf journalist team Evan Slater and Peter Taras capture the essence of waves and the swells that produce them in this breathtaking collection of wave photography. Slater characterizes four distinct swells from different corners of the globe and traces their journeys throughout the year from storm to seashore. His reflective, informative essays amplify these powerful images of hundreds of waves frozen in time, beautiful, simple, universal, yet wholly unique—and the best thing to watch on the planet. ...more"], "price": 45.58},
{"url": "https://books.toscrape.com/catalogue/my-name-is-lucy-barton_720/index.html", "title": "My Name Is Lucy Barton", "upc": "7", "product_type": "books", "price_excl_tax": 41.56, "price_incl_tax": 41.56, "tax": 0.0, "availability": 14, "num_reviews": 0, "stars": "star-rating One", "category": "fiction", "description": ["A new book by Pulitzer Prize winner Elizabeth Strout is cause for celebration. Her bestselling novels, including Olive Kitteridge and The Burgess Boys,have illuminated our most tender relationships. Now, in My Name Is Lucy Barton, this extraordinary writer shows how a simple hospital visit becomes a portal to the most tender relationship of all—the one between mother and d A new book by Pulitzer Prize winner Elizabeth Strout is cause for celebration. Her bestselling novels, including Olive Kitteridge and The Burgess Boys, have illuminated our most tender relationships. Now, in My Name Is Lucy Barton, this extraordinary writer shows how a simple hospital visit becomes a portal to the most tender relationship of all—the one between mother and daughter.   Lucy Barton is recovering slowly from what should have been a simple operation. Her mother, to whom she hasn’t spoken for many years, comes to see her. Gentle gossip about people from Lucy’s childhood in Amgash, Illinois, seems to reconnect them, but just below the surface lie the tension and longing that have informed every aspect of Lucy’s life: her escape from her troubled family, her desire to become a writer, her marriage, her love for her two daughters. Knitting this powerful narrative together is the brilliant storytelling voice of Lucy herself: keenly observant, deeply human, and truly unforgettable. ...more"], "price": 41.56},
{"url": "https://books.toscrape.com/catalogue/hold-your-breath-search-and-rescue-1_700/index.html", "title": "Hold Your Breath (Search and Rescue #1)", "upc": "0", "product_type": "books", "price_excl_tax": 28.82, "price_incl_tax": 28.82, "tax": 0.0, "availability": 14, "num_reviews": 0, "stars": "star-rating One", "category": "romance", "description": ["In the remote Rocky Mountains, lives depend on the Search & Rescue brotherhood. But in a place this far off the map, trust is hard to come by and secrets can be murder...As the captain of Field County's ice rescue dive team, Callum Cook is driven to perfection. But when he meets new diver Louise \"Lou\" Sparks, all that hard-won order is obliterated in an instant. Lou is In the remote Rocky Mountains, lives depend on the Search & Rescue brotherhood. But in a place this far off the map, trust is hard to come by and secrets can be murder...As the captain of Field County's ice rescue dive team, Callum Cook is driven to perfection. But when he meets new diver Louise \"Lou\" Sparks, all that hard-won order is obliterated in an instant. Lou is a hurricane. A walking disaster. And with her, he's never felt more alive...even if keeping her safe may just kill him.Lou's new to the Rockies, intent on escaping her controlling ex, and she's determined to make it on her own terms...no matter how tempting Callum may be. But when a routine training exercise unearths a body, Lou and Callum find themselves thrust into a deadly game of cat and mouse with a killer who will stop at nothing to silence Lou-and prove that not even her new Search and Rescue family can keep her safe forever. ...more"], "price": 28.82},
{"url": "https://books.toscrape.com/catalogue/code-name-verity-code-name-verity-1_680/index.html", "title": "Code Name Verity (Code Name Verity #1)", "upc": "3", "product_type": "books", "price_excl_tax": 22.13, "price_incl_tax": 22.13, "tax": 0.0, "availability": 14, "num_reviews": 0, "stars": "star-rating Four", "category": "add a comment", "description": ["I have two weeks. You'll shoot me at the end no matter what I do.That's what you do to enemy agents. It's what we do to enemy agents. But I look at all the dark and twisted roads ahead and cooperation is the easy way out. Possibly the only way out for a girl caught red-handed doing dirty work like mine - and I will do anything, anything to avoid SS-Hauptsturmführer von Lin I have two weeks. You'll shoot me at the end no matter what I do.That's what you do to enemy agents. It's what we do to enemy agents. But I look at all the dark and twisted roads ahead and cooperation is the easy way out. Possibly the only way out for a girl caught red-handed doing dirty work like mine - and I will do anything, anything to avoid SS-Hauptsturmführer von Linden interrogating me again.He has said that I can have as much paper as I need. All I have to do is cough up everything I can remember about the British War Effort. And I'm going to. But the story of how I came to be here starts with my friend Maddie. She is the pilot who flew me into France - an Allied Invasion of Two.We are a sensational team. ...more"], "price": 22.13},
{"url": "https://books.toscrape.com/catalogue/all-the-light-we-cannot-see_660/index.html", "title": "All the Light We Cannot See", "upc": "3", "product_type": "books", "price_excl_tax": 29.87, "price_incl_tax": 29.87, "tax": 0.0, "availability": 14, "num_reviews": 0, "stars": "star-rating Five", "category": "historical", "description": ["WINNER OF THE PULITZER PRIZEFrom the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.Marie-Laure lives with her father in Paris near the Museum of Natural Histo WINNER OF THE PULITZER PRIZEFrom the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant New York Times bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.Marie-Laure lives with her father in Paris near the Museum of Natural History, where he works as the master of its thousands of locks. When she is six, Marie-Laure goes blind and her father builds a perfect miniature of their neighborhood so she can memorize it by touch and navigate her way home. When she is twelve, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure’s reclusive great-uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel.In a mining town in Germany, the orphan Werner grows up with his younger sister, enchanted by a crude radio they find. Werner becomes an expert at building and fixing these crucial new instruments, a talent that wins him a place at a brutal academy for Hitler Youth, then a special assignment to track the resistance. More and more aware of the human cost of his intelligence, Werner travels through the heart of the war and, finally, into Saint-Malo, where his story and Marie-Laure’s converge.Doerr’s “stunning sense of physical detail and gorgeous metaphors” (San Francisco Chronicle) are dazzling. Deftly interweaving the lives of Marie-Laure and Werner, he illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, a National Book Award finalist, All the Light We Cannot See is a magnificent, deeply moving novel from a writer “whose sentences never fail to thrill” (Los Angeles Times). ...more"], "price": 29.87},
{"url": "https://books.toscrape.com/catalogue/the-midnight-watch-a-novel-of-the-titanic-and-the-californian_640/index.html", "title": "The Midnight Watch: A Novel of the Titanic and the Californian", "upc": "1", "product_type": "books", "price_excl_tax": 26.2, "price_incl_tax": 26.2, "tax": 0.0, "availability": 12, "num_reviews": 0, "stars": "star-rating One", "category": "add a comment", "description": ["As the Titanic and her passengers sank slowly into the Atlantic Ocean after striking an iceberg late in the evening of April 14, 1912, a nearby ship looked on. Second Officer Herbert Stone, in charge of the midnight watch on the SS Californian sitting idly a few miles north, saw the distress rockets that the Titanic fired. He alerted the captain, Stanley Lord, who was slee As the Titanic and her passengers sank slowly into the Atlantic Ocean after striking an iceberg late in the evening of April 14, 1912, a nearby ship looked on. Second Officer Herbert Stone, in charge of the midnight watch on the SS Californian sitting idly a few miles north, saw the distress rockets that the Titanic fired. He alerted the captain, Stanley Lord, who was sleeping in the chartroom below, but Lord did not come to the bridge. Eight rockets were fired during the dark hours of the midnight watch, and eight rockets were ignored. The next morning, the Titanic was at the bottom of the sea and more than 1,500 people were dead. When they learned of the extent of the tragedy, Lord and Stone did everything they could to hide their role in the disaster, but pursued by newspapermen, lawyers, and political leaders in America and England, their terrible secret was eventually revealed. The Midnight Watch is a fictional telling of what may have occurred that night on the SS Californian, and the resulting desperation of Officer Stone and Captain Lord in the aftermath of their inaction.Told not only from the perspective of the SS Californian crew, but also through the eyes of a family of third-class passengers who perished in the disaster, the narrative is drawn together by Steadman, a tenacious Boston journalist who does not rest until the truth is found. The Midnight Watch is a powerful and dramatic debut novel--the result of many years of research in Liverpool, London, New York, and Boston, and informed by the author's own experiences as a ship's officer and a lawyer. ...more"], "price": 26.2},
{"url": "https://books.toscrape.com/catalogue/hide-away-eve-duncan-20_620/index.html", "title": "Hide Away (Eve Duncan #20)", "upc": "b", "product_type": "books", "price_excl_tax": 11.84, "price_incl_tax": 11.84, "tax": 0.0, "availability": 12, "num_reviews": 0, "stars": "star-rating One", "category": "mystery", "description": ["Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where th Iris Johansen's beloved forensic sculptor Eve Duncan is back and now the stakes are higher than ever. Dramatic changes are on the horizon for Eve and Joe Quinn and their relationship may never be the same. Faced with the task of protecting Cara Delaney, a young girl with ruthless enemies who want to see her dead, Eve takes her away to the remote Scottish Highlands where they join Jane MacGuire in search of a hidden treasure. But nowhere is far enough away to protect Cara from danger. With enemies closing in from all sides, Hide Away is a high-octane thriller that fans will not want to miss. ...more"], "price": 11.84},
{"url": "https://books.toscrape.com/catalogue/mothering-sunday_600/index.html", "title": "Mothering Sunday", "upc": "4", "product_type": "books", "price_excl_tax": 13.34, "price_incl_tax": 13.34, "tax": 0.0, "availability": 11, "num_reviews": 0, "stars": "star-rating Two", "category": "fiction", "description": ["From the Booker Award winner: a luminous, profoundly moving work of fiction that begins with an afternoon tryst in 1924 between a servant girl and the young man of the neighboring house, but then opens to reveal the whole life of a remarkable woman.Twenty-two year old Jane Fairchild, orphaned at birth, has worked as a maid at one English country estate since she was sixtee From the Booker Award winner: a luminous, profoundly moving work of fiction that begins with an afternoon tryst in 1924 between a servant girl and the young man of the neighboring house, but then opens to reveal the whole life of a remarkable woman.Twenty-two year old Jane Fairchild, orphaned at birth, has worked as a maid at one English country estate since she was sixteen. And for almost all of those years she has been the secret lover to Paul Sheringham, the scion of the estate next door. On an unseasonably warm March afternoon, Jane and Paul will make love for the last time--though not, as Jane believes, because Paul is about to be married--and the events of the day will alter Jane's life forever. As the narrative moves back and forth from 1924 to the end of the century, what we know and understand about Jane--about the way she loves, thinks, feels, sees, remembers--deepens with every beautifully wrought moment. Her story is one of profound self-discovery and through her, Graham Swift has created an emotionally soaring and deeply affecting work of fiction. ...more"], "price": 13.34},
{"url": "https://books.toscrape.com/catalogue/without-shame_580/index.html", "title": "Without Shame", "upc": "a", "product_type": "books", "price_excl_tax": 48.27, "price_incl_tax": 48.27, "tax": 0.0, "availability": 9, "num_reviews": 0, "stars": "star-rating Five", "category": "add a comment", "description": ["East Pakistan, 1968: In Sariyah’s village, shame is a virtue she never mastered. As a child, she learned to read in secret, kept talismans against her father’s orders, and questioned everything, even Allah. Now she is practicing how to be a “woman with shame,” torn between promises to her family and to herself. She yearns to join a movement with her fellow Bengalis, who ar East Pakistan, 1968: In Sariyah’s village, shame is a virtue she never mastered. As a child, she learned to read in secret, kept talismans against her father’s orders, and questioned everything, even Allah. Now she is practicing how to be a “woman with shame,” torn between promises to her family and to herself. She yearns to join a movement with her fellow Bengalis, who are gripping onto their language and cultural identity against colonial powers – but she is continuously sucked into the narrow visions of her father.In the midst of a desperate movement for Bengali freedom, a presumptuous American has come to teach English. Rodney Creed - self-interested, naive, entitled - comes with the bright optimism of a college graduate, too eager to sense the rumbling ground beneath him...until he meets Sariyah. Rodney believes he is there to teach, but he will learn painful, irreversible things.Without Shame is a love story at its core – but not in the traditional sense. It’s about love of one’s country, culture, God, and language. It’s about the power of identity to shine through when other forces threaten to overshadow it. ...more"], "price": 48.27},
{"url": "https://books.toscrape.com/catalogue/chernobyl-012340-the-incredible-true-story-of-the-worlds-worst-nuclear-disaster_560/index.html", "title": "Chernobyl 01:23:40: The Incredible True Story of the World's Worst Nuclear Disaster", "upc": "7", "product_type": "books", "price_excl_tax": 35.92, "price_incl_tax": 35.92, "tax": 0.0, "availability": 9, "num_reviews": 0, "stars": "star-rating Two", "category": "nonfiction", "description": ["At 01:23:40 on April 26th 1986, Alexander Akimov pressed the emergency shutdown button at Chernobyl’s fourth nuclear reactor. It was an act that forced the permanent evacuation of a city, killed thousands and crippled the Soviet Union. The event spawned decades of conflicting, exaggerated and inaccurate stories.This book, the result of five years of research, presents an a At 01:23:40 on April 26th 1986, Alexander Akimov pressed the emergency shutdown button at Chernobyl’s fourth nuclear reactor. It was an act that forced the permanent evacuation of a city, killed thousands and crippled the Soviet Union. The event spawned decades of conflicting, exaggerated and inaccurate stories.This book, the result of five years of research, presents an accessible but comprehensive account of what really happened. From the desperate fight to prevent a burning reactor core from irradiating eastern Europe, to the self-sacrifice of the heroic men who entered fields of radiation so strong that machines wouldn’t work, to the surprising truth about the legendary ‘Chernobyl divers’, all the way through to the USSR’s final show-trial. The historical narrative is interwoven with a story of the author’s own spontaneous journey to Ukraine’s still-abandoned city of Pripyat and the wider Chernobyl Zone.Complete with over 45 pages of photographs of modern-day Pripyat and technical diagrams of the power station, Chernobyl 01:23:40 is a fascinating new account of the world’s worst nuclear disaster. ...more"], "price": 35.92},
{"url": "https://books.toscrape.com/catalogue/roller-girl_540/index.html", "title": "Roller Girl", "upc": "a", "product_type": "books", "price_excl_tax": 14.1, "price_incl_tax": 14.1, "tax": 0.0, "availability": 8, "num_reviews": 0, "stars": "star-rating Five", "category": "sequential art", "description": ["For fans of Raina Telgemeier’s Smile, a heartwarming graphic novel about friendship and surviving junior high through the power of roller derby. Twelve-year-old Astrid has always done everything with her best friend Nicole. So when Astrid signs up for roller derby camp, she assumes Nicole will too. But Nicole signs up for dance camp with a new friend instead, and so begins For fans of Raina Telgemeier’s Smile, a heartwarming graphic novel about friendship and surviving junior high through the power of roller derby. Twelve-year-old Astrid has always done everything with her best friend Nicole. So when Astrid signs up for roller derby camp, she assumes Nicole will too. But Nicole signs up for dance camp with a new friend instead, and so begins the toughest summer of Astrid's life. There are bumps and bruises as Astrid learns who she is without Nicole...and what it takes to be a strong, tough roller girl. ...more"], "price": 14.1},
{"url": "https://books.toscrape.com/catalogue/heaven-is-for-real-a-little-boys-astounding-story-of-his-trip-to-heaven-and-back_520/index.html", "title": "Heaven is for Real: A Little Boy's Astounding Story of His Trip to Heaven and Back", "upc": "d", "product_type": "books", "price_excl_tax": 52.86, "price_incl_tax": 52.86, "tax": 0.0, "availability": 8, "num_reviews": 0, "stars": "star-rating Two", "category": "default", "description": ["A beautifully written glimpse into heaven that will encourage those who doubtand thrill those who believe.Ron Hall, coauthor of Same Kind of Different as MeDo you remember the hospital, Colton? Sonja said. Yes, mommy, I remember, he said. That s where theangels sang to me.When Colton Burpo made it through an emergency appendectomy, his familywas overjoyed at his miraculous A beautifully written glimpse into heaven that will encourage those who doubtand thrill those who believe.Ron Hall, coauthor of Same Kind of Different as MeDo you remember the hospital, Colton? Sonja said. Yes, mommy, I remember, he said. That s where theangels sang to me.When Colton Burpo made it through an emergency appendectomy, his familywas overjoyed at his miraculous survival. What they weren t expecting, though, was the story that emerged in the months that followed a story as beautiful as itwas extraordinary, detailing their little boy s trip to heaven and back.Colton, not yet four years old, told his parents he left his body during thesurgery and authenticated that claim by describing exactly what his parents weredoing in another part of the hospital while he was being operated on. He talked ofvisiting heaven and relayed stories told to him by people he met there whom hehad never met in life, sharing events that happened even before he was born. He also astonished his parents with descriptions and obscure details about heaven thatmatched the Bible exactly, though he had not yet learned to read.With disarming innocence and the plainspoken boldness of a child, Colton tells of meeting long-departed family members. He describes Jesus, the angels, how really, really big God is, and how much God loves us. Retold by his father, but using Colton s uniquely simple words, Heaven Is for Real offers a glimpseof the world that awaits us, where as Colton says, Nobody is old and nobodywears glasses.Heaven Is for Real will forever change the way you think of eternity, offeringthe chance to see, and believe, like a child.\" ...more"], "price": 52.86},
{"url": "https://books.toscrape.com/catalogue/the-story-of-art_500/index.html", "title": "The Story of Art", "upc": "9", "product_type": "books", "price_excl_tax": 41.14, "price_incl_tax": 41.14, "tax": 0.0, "availability": 7, "num_reviews": 0, "stars": "star-rating Four", "category": "art", "description": ["This text is the 16th revised and updated edition of this introduction to art, from the earliest cave paintings to experimental art. Eight new artists from the modern period have been introduced. They are: Corot, Kollwitz, Nolde, de Chirico, Brancussi, Magritte, Nicolson and Morandi. A sequence of new endings have been added, and the captions are now fuller, including the This text is the 16th revised and updated edition of this introduction to art, from the earliest cave paintings to experimental art. Eight new artists from the modern period have been introduced. They are: Corot, Kollwitz, Nolde, de Chirico, Brancussi, Magritte, Nicolson and Morandi. A sequence of new endings have been added, and the captions are now fuller, including the medium and dimension of the works illustrated. Six fold-outs present selected large-scale works. They are: Van Eyck's Ghent Altarpiece, Leonardo's Last Supper, Botticelli's Birth of Venus, Jackson Pollock's One (Number 31, 1950), Van der Weyden's Descent from the Cross and Michelangelo's Sistine Chapel ceiling. ...more"], "price": 41.14},
{"url": "https://books.toscrape.com/catalogue/nightstruck-a-novel_480/index.html", "title": "Nightstruck: A Novel", "upc": "7", "product_type": "books", "price_excl_tax": 50.35, "price_incl_tax": 50.35, "tax": 0.0, "availability": 7, "num_reviews": 0, "stars": "star-rating Four", "category": "young adult", "description": ["It starts with a cry in the night.Becket, walking her dog one winter evening, fears it’s an abandoned baby left out in the cold. But it is something else—something evil—and it tricks Becket into opening a doorway to another realm, letting a darkness into our world, a corruption that begins transforming Philadelphia into a sinister and menacing version of itself…but only at It starts with a cry in the night.Becket, walking her dog one winter evening, fears it’s an abandoned baby left out in the cold. But it is something else—something evil—and it tricks Becket into opening a doorway to another realm, letting a darkness into our world, a corruption that begins transforming Philadelphia into a sinister and menacing version of itself…but only at night.The changes are subtle at first, causing Becket to doubt her senses and her sanity. But soon the nightmarish truth is impossible to deny: By day, the city is just a city, but at night it literally comes alive with malevolent purpose. Brick and steel become bone, streetlights turn into gallows, and hungry alleys wait to snare mortal victims. Terrified citizens huddle indoors after dusk, as others succumb to the siren song of the night, letting their darker sides run wild.Once, Becket’s biggest problems were living up to her police commissioner father’s high expectations and a secret crush on her best friend’s boyfriend. Now she must find a way to survive and protect her loved ones…before the darkness takes her as well. ...more"], "price": 50.35},
{"url": "https://books.toscrape.com/catalogue/benjamin-franklin-an-american-life_460/index.html", "title": "Benjamin Franklin: An American Life", "upc": "5", "product_type": "books", "price_excl_tax": 48.19, "price_incl_tax": 48.19, "tax": 0.0, "availability": 7, "num_reviews": 0, "stars": "star-rating Three", "category": "biography", "description": ["Benjamin Franklin is the Founding Father who winks at us. An ambitious urban entrepreneur who rose up the social ladder, from leather-aproned shopkeeper to dining with kings, he seems made of flesh rather than of marble. In bestselling author Walter Isaacson's vivid and witty full-scale biography, we discover why Franklin seems to turn to us from history's stage with eyes Benjamin Franklin is the Founding Father who winks at us. An ambitious urban entrepreneur who rose up the social ladder, from leather-aproned shopkeeper to dining with kings, he seems made of flesh rather than of marble. In bestselling author Walter Isaacson's vivid and witty full-scale biography, we discover why Franklin seems to turn to us from history's stage with eyes that twinkle from behind his new-fangled spectacles. By bringing Franklin to life, Isaacson shows how he helped to define both his own time and ours. He was, during his 84-year life, America's best scientist, inventor, diplomat, writer, and business strategist, and he was also one of its most practical -- though not most profound -- political thinkers. He proved by flying a kite that lightning was electricity, and he invented a rod to tame it. He sought practical ways to make stoves less smoky and commonwealths less corrupt. He organized neighborhood constabularies and international alliances, local lending libraries and national legislatures. He combined two types of lenses to create bifocals and two concepts of representation to foster the nation's federal compromise. He was the only man who shaped all the founding documents of America: the Albany Plan of Union, the Declaration of Independence, the treaty of alliance with France, the peace treaty with England, and the Constitution. And he helped invent America's unique style of homespun humor, democratic values, and philosophical pragmatism. But the most interesting thing that Franklin invented, and continually reinvented, was himself. America's first great publicist, he was, in his life and in his writings, consciously trying to create a new American archetype. In the process, he carefully crafted his own persona, portrayed it in public, and polished it for posterity. Through it all, he trusted the hearts and minds of his fellow \"leather-aprons\" more than he did those of any inbred elite. He saw middle-class values as a source of social strength, not as something to be derided. His guiding principle was a \"dislike of everything that tended to debase the spirit of the common people.\" Few of his fellow founders felt this comfort with democracy so fully, and none so intuitively. In this colorful and intimate narrative, Isaacson provides the full sweep of Franklin's amazing life, from his days as a runaway printer to his triumphs as a statesman, scientist, and Founding Father. He chronicles Franklin's tumultuous relationship with his illegitimate son and grandson, his practical marriage, and his flirtations with the ladies of Paris. He also shows how Franklin helped to create the American character and why he has a particular resonance in the twenty-first century. ...more"], "price": 48.19},
{"url": "https://books.toscrape.com/catalogue/the-barefoot-contessa-cookbook_440/index.html", "title": "The Barefoot Contessa Cookbook", "upc": "6", "product_type": "books", "price_excl_tax": 59.92, "price_incl_tax": 59.92, "tax": 0.0, "availability": 6, "num_reviews": 0, "stars": "star-rating Five", "category": "food and drink", "description": ["For more than twenty years, Barefoot Contessa, the acclaimed specialty food store, has been cooking and baking extraordinary dishes for enthusiastic customers in the Hamptons. For many of those years, people have tried to get the exuberant owner, Ina Garten, to share the secrets of her store. Finally, the energy and style that make Barefoot Contessa such a special place ar For more than twenty years, Barefoot Contessa, the acclaimed specialty food store, has been cooking and baking extraordinary dishes for enthusiastic customers in the Hamptons. For many of those years, people have tried to get the exuberant owner, Ina Garten, to share the secrets of her store. Finally, the energy and style that make Barefoot Contessa such a special place are shown here, with dozens of recipes and more than 160 breathtaking photographs, in The Barefoot Contessa Cookbook.Ina's most popular recipes use familiar ingredients, but they taste even better than you would expect. Her Pan-Fried Onion Dip is the real thing, with slowly car-amelized onions and fresh sour cream. Tomato soup is created from oven-roasted tomatoes and fresh basil to intensify the flavors. Meat loaf is as good as your grandmother's, but it's healthier because it's made with ground turkey and fresh herbs. The light and flaky Maple-Oatmeal Scones are baked with rolled oats, whole wheat, and real maple syrup. Now these and other famous Barefoot Contessa recipes can be prepared at home.Ina says that before she owned a specialty food store she often spent a week making dinner for six friends. Her experience at Barefoot Contessa has given her hundreds of ideas for creating wonderful parties in a few hours. And they're all in this book. Crab Cakes with Rémoulade Sauce can be stored overnight in the refrigerator and sautéed just before the guests arrive. Cheddar Corn Chowder can be made days ahead, reheated, and served with a salad and bread for a delicious autumn lunch. The ingredients for Grilled Salmon Salad can all be prepared ahead and tossed together before serving. The batter for the Raspberry Corn Muffins can be mixed a day before and popped into the oven just before breakfast.Ina Garten teaches us how to entertain with style, simplicity, and a relaxed sense of fun. There are notes throughout the book for giving cocktail parties, lunches, and dinner parties where everything is done before the guests arrive. And there are easy instructions for creating gorgeous party platters that don't even require you to cook!With Ina Garten and The Barefoot Contessa Cookbook, you have the perfect recipe for hosting parties that are easy and fun for everyone--including the cook. ...more"], "price": 59.92},
{"url": "https://books.toscrape.com/catalogue/world-without-end-the-pillars-of-the-earth-2_420/index.html", "title": "World Without End (The Pillars of the Earth #2)", "upc": "2", "product_type": "books", "price_excl_tax": 32.97, "price_incl_tax": 32.97, "tax": 0.0, "availability": 5, "num_reviews": 0, "stars": "star-rating Four", "category": "historical fiction", "description": ["Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are agai Eighteen years after the publication of The Pillars of the Earth, Ken Follett has written the the long awaited sequel, World Without End. World Without End takes place in the same town of Kingsbridge, two centuries after the townspeople finished building the exquisite Gothic cathedral that was at the heart of The Pillars of the Earth. The cathedral and the priory are again at the center of a web of love and hate, greed and pride, ambition and revenge, but this sequel stands on its own. This time, the men and women among an extraordinary cast of characters find themselves at a crossroad of new ideas -- about medicine, commerce, architecture, and justice. In a world where proponents of the old ways fiercely battle those with progressive minds, the intrigue and tension quickly reach a boiling point against the devastating backdrop of the greatest natural disaster ever to strike the human race: the Black Death. ...more"], "price": 32.97},
{"url": "https://books.toscrape.com/catalogue/the-dream-thieves-the-raven-cycle-2_400/index.html", "title": "The Dream Thieves (The Raven Cycle #2)", "upc": "f", "product_type": "books", "price_excl_tax": 34.5, "price_incl_tax": 34.5, "tax": 0.0, "availability": 5, "num_reviews": 0, "stars": "star-rating One", "category": "default", "description": ["If you could steal things from dreams, what would you take?Ronan Lynch has secrets. Some he keeps from others. Some he keeps from himself.One secret: Ronan can bring things out of his dreams.And sometimes he's not the only one who wants those things.Ronan is one of the raven boys—a group of friends, practically brothers, searching for a dead king named Glendower, who they If you could steal things from dreams, what would you take?Ronan Lynch has secrets. Some he keeps from others. Some he keeps from himself.One secret: Ronan can bring things out of his dreams.And sometimes he's not the only one who wants those things.Ronan is one of the raven boys—a group of friends, practically brothers, searching for a dead king named Glendower, who they think is hidden somewhere in the hills by their elite private school, Aglionby Academy. The path to Glendower has long lived as an undercurrent beneath town. But now, like Ronan's secrets, it is beginning to rise to the surface—changing everything in its wake.Of The Raven Boys, Entertainment Weekly wrote, \"Maggie Stiefvater's can't-put-it-down paranormal adventure will leave you clamoring for book two.\" Now the second book is here, with the same wild imagination, dark romance, and heart-stopping twists that only Maggie Stiefvater can conjure. ...more"], "price": 34.5},
{"url": "https://books.toscrape.com/catalogue/isla-and-the-happily-ever-after-anna-and-the-french-kiss-3_380/index.html", "title": "Isla and the Happily Ever After (Anna and the French Kiss #3)", "upc": "4", "product_type": "books", "price_excl_tax": 48.13, "price_incl_tax": 48.13, "tax": 0.0, "availability": 5, "num_reviews": 0, "stars": "star-rating Five", "category": "young adult", "description": ["Love ignites in the City That Never Sleeps, but can it last? Hopeless romantic Isla has had a crush on introspective cartoonist Josh since their first year at the School of America in Paris. And after a chance encounter in Manhattan over the summer, romance might be closer than Isla imagined. But as they begin their senior year back in France, Isla and Josh are forced to c Love ignites in the City That Never Sleeps, but can it last? Hopeless romantic Isla has had a crush on introspective cartoonist Josh since their first year at the School of America in Paris. And after a chance encounter in Manhattan over the summer, romance might be closer than Isla imagined. But as they begin their senior year back in France, Isla and Josh are forced to confront the challenges every young couple must face, including family drama, uncertainty about their college futures, and the very real possibility of being apart. Featuring cameos from fan-favorites Anna, Étienne, Lola, and Cricket, this sweet and sexy story of true love—set against the stunning backdrops of New York City, Paris, and Barcelona—is a swoonworthy conclusion to Stephanie Perkins’s beloved series. ...more"], "price": 48.13},
{"url": "https://books.toscrape.com/catalogue/alight-the-generations-trilogy-2_360/index.html", "title": "Alight (The Generations Trilogy #2)", "upc": "d", "product_type": "books", "price_excl_tax": 58.59, "price_incl_tax": 58.59, "tax": 0.0, "availability": 5, "num_reviews": 0, "stars": "star-rating Four", "category": "default", "description": ["Alight is the second installment in the YA sci-fi adventure trilogy by New York Times bestselling author Scott Sigler, hot on the heels of Alive.Alight reveals to readers the further adventures of Em, Spingate, O’Malley, Bishop, and the other young heroes introduced in Alive. In Alive, Em fought to assert herself as leader and her friends tried to comprehend their own myst Alight is the second installment in the YA sci-fi adventure trilogy by New York Times bestselling author Scott Sigler, hot on the heels of Alive.Alight reveals to readers the further adventures of Em, Spingate, O’Malley, Bishop, and the other young heroes introduced in Alive. In Alive, Em fought to assert herself as leader and her friends tried to comprehend their own mysterious identity; now she must wrestle not with the challenge of winning power but the grave responsibility of having assumed it, and she and her friends must contend with a grim fact: the revelation of their identity is not an answer but another question—and one with terrifying implications. ...more"], "price": 58.59},
{"url": "https://books.toscrape.com/catalogue/shopaholic-ties-the-knot-shopaholic-3_340/index.html", "title": "Shopaholic Ties the Knot (Shopaholic #3)", "upc": "3", "product_type": "books", "price_excl_tax": 48.39, "price_incl_tax": 48.39, "tax": 0.0, "availability": 4, "num_reviews": 0, "stars": "star-rating Five", "category": "womens fiction", "description": ["Life has been good for Becky Bloomwood: She’s become the best personal shopper at Barneys, she and her successful entrepreneurial boyfriend, Luke, are living happily in Manhattan’s West Village, and her new next-door neighbor is a fashion designer! But with her best friend, Suze, engaged, how can Becky fail to notice that her own ring finger is bare? Not that she’s been th Life has been good for Becky Bloomwood: She’s become the best personal shopper at Barneys, she and her successful entrepreneurial boyfriend, Luke, are living happily in Manhattan’s West Village, and her new next-door neighbor is a fashion designer! But with her best friend, Suze, engaged, how can Becky fail to notice that her own ring finger is bare? Not that she’s been thinking of marriage (or diamonds) or anything . . . Then Luke proposes! Bridal registries dance in Becky’s head. Problem is, two other people are planning her wedding: Becky’s overjoyed mother has been waiting forever to host a backyard wedding, with the bride resplendent in Mum’s frilly old gown. While Luke’s high-society mother is insisting on a glamorous, all-expenses-paid affair at the Plaza. Both weddings for the same day. And Becky can’t seem to turn down either one. Can everyone’s favorite shopaholic tie the knot before everything unravels? ...more"], "price": 48.39},
{"url": "https://books.toscrape.com/catalogue/far-from-true-promise-falls-trilogy-2_320/index.html", "title": "Far From True (Promise Falls Trilogy #2)", "upc": "a", "product_type": "books", "price_excl_tax": 34.93, "price_incl_tax": 34.93, "tax": 0.0, "availability": 4, "num_reviews": 0, "stars": "star-rating Two", "category": "thriller", "description": ["New York Times and #1 international bestselling author Linwood Barclay delivers the second spine-chilling thriller set in the troubled town of Promise Falls, following the electrifying cliffhanger ending of Broken Promise... After the screen of a run-down drive-in movie theater collapses and kills fourpeople, the daughter of one of the victims asks private investigator Ca New York Times and #1 international bestselling author Linwood Barclay delivers the second spine-chilling thriller set in the troubled town of Promise Falls, following the electrifying cliffhanger ending of Broken Promise...   After the screen of a run-down drive-in movie theater collapses and kills four people, the daughter of one of the victims asks private investigator Cal Weaver to look into a recent break-in at her father’s house. Cal discovers a hidden basement room where it’s clear that salacious activities have taken place—as well as evidence of missing DVDs. But his investigation soon becomes more complicated when he realizes it may not be discs the thief was actually interested in....   Meanwhile, Detective Barry Duckworth is still trying to solve two murders—one of which is three years old—he believes are connected, since each featured a similar distinctive wound.   As the lies begin to unravel, Cal is headed straight into the heart of a dark secret as his search uncovers more startling truths about Promise Falls. And when yet another murder happens, Cal and Barry are both driven to pursue their investigations, no matter where they lead. Evil deeds long thought buried are about to haunt the residents of this town—as the sins of the past and present collide with terrifying results. ...more"], "price": 34.93},
{"url": "https://books.toscrape.com/catalogue/walk-the-edge-thunder-road-2_300/index.html", "title": "Walk the Edge (Thunder Road #2)", "upc": "0", "product_type": "books", "price_excl_tax": 32.36, "price_incl_tax": 32.36, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Three", "category": "young adult", "description": ["One moment of recklessness will change their worlds.Smart. Responsible. That's seventeen-year-old Breanna's role in her large family, and heaven forbid she put a toe out of line. Until one night of shockingly un-Breanna-like behavior puts her into a vicious cyber-bully's line of fire—and brings fellow senior Thomas \"Razor\" Turner into her life. Razor lives for the Reign of One moment of recklessness will change their worlds.Smart. Responsible. That's seventeen-year-old Breanna's role in her large family, and heaven forbid she put a toe out of line. Until one night of shockingly un-Breanna-like behavior puts her into a vicious cyber-bully's line of fire—and brings fellow senior Thomas \"Razor\" Turner into her life. Razor lives for the Reign of Terror motorcycle club, and good girls like Breanna just don't belong. But when he learns she's being blackmailed over a compromising picture of the two of them—a picture that turns one unexpected and beautiful moment into ugliness—he knows it's time to step outside the rules. And so they make a pact: he'll help her track down her blackmailer, and in return she'll help him seek answers to the mystery that's haunted him—one that not even his club brothers have been willing to discuss. But the more time they spend together, the more their feelings grow. And suddenly they're both walking the edge of discovering who they really are, what they want, and where they're going from here. ...more"], "price": 32.36},
{"url": "https://books.toscrape.com/catalogue/the-silkworm-cormoran-strike-2_280/index.html", "title": "The Silkworm (Cormoran Strike #2)", "upc": "f", "product_type": "books", "price_excl_tax": 23.05, "price_incl_tax": 23.05, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Five", "category": "mystery", "description": ["Private investigator Cormoran Strike returns in a new mystery from Robert Galbraith, author of the #1 international bestseller The Cuckoo's Calling.When novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, Mrs. Quine just thinks her husband has gone off by himself for a few days—as he has done before—and she wants Strike to find Private investigator Cormoran Strike returns in a new mystery from Robert Galbraith, author of the #1 international bestseller The Cuckoo's Calling.When novelist Owen Quine goes missing, his wife calls in private detective Cormoran Strike. At first, Mrs. Quine just thinks her husband has gone off by himself for a few days—as he has done before—and she wants Strike to find him and bring him home.But as Strike investigates, it becomes clear that there is more to Quine's disappearance than his wife realizes. The novelist has just completed a manuscript featuring poisonous pen-portraits of almost everyone he knows. If the novel were to be published, it would ruin lives—meaning that there are a lot of people who might want him silenced.When Quine is found brutally murdered under bizarre circumstances, it becomes a race against time to understand the motivation of a ruthless killer, a killer unlike any Strike has encountered before... ...more"], "price": 23.05},
{"url": "https://books.toscrape.com/catalogue/the-lean-startup-how-todays-entrepreneurs-use-continuous-innovation-to-create-radically-successful-businesses_260/index.html", "title": "The Lean Startup: How Today's Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses", "upc": "7", "product_type": "books", "price_excl_tax": 33.92, "price_incl_tax": 33.92, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Three", "category": "business", "description": ["Most startups fail. But many of those failures are preventable. The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched. Eric Ries defines a startup asan organization dedicated to creating something new under conditions of extreme uncertainty. This is just as true for one person in a garage or a Most startups fail. But many of those failures are preventable.  The Lean Startup is a new approach being adopted across the globe, changing the way companies are built and new products are launched. Eric Ries defines a startup as an organization dedicated to creating something new under conditions of extreme uncertainty. This is just as true for one person in a garage or a group of seasoned professionals in a Fortune 500 boardroom. What they have in common is a mission to penetrate that fog of uncertainty to discover a successful path to a sustainable business. The Lean Startup approach fosters companies that are both more capital efficient and that leverage human creativity more effectively.  Inspired by lessons from lean manufacturing, it relies on “validated learning,” rapid scientific experimentation, as well as a number of counter-intuitive practices that shorten product development cycles, measure actual progress without resorting to vanity metrics, and learn what customers really want. It enables a company to shift directions with agility, altering plans inch by inch, minute by minute. Rather than wasting time creating elaborate business plans, The Lean Startup offers entrepreneurs - in companies of all sizes - a way to test their vision continuously, to adapt and adjust before it’s too late. Ries provides a scientific approach to creating and managing successful startups in a age when companies need to innovate more than ever. ...more"], "price": 33.92},
{"url": "https://books.toscrape.com/catalogue/the-da-vinci-code-robert-langdon-2_240/index.html", "title": "The Da Vinci Code (Robert Langdon #2)", "upc": "d", "product_type": "books", "price_excl_tax": 22.96, "price_incl_tax": 22.96, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Two", "category": "fiction", "description": ["An ingenious code hidden in the works of Leonardo da Vinci. A desperate race through the cathedrals and castles of Europe. An astonishing truth concealed for centuries . . . unveiled at last.While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body An ingenious code hidden in the works of Leonardo da Vinci. A desperate race through the cathedrals and castles of Europe. An astonishing truth concealed for centuries . . . unveiled at last.While in Paris, Harvard symbologist Robert Langdon is awakened by a phone call in the dead of the night. The elderly curator of the Louvre has been murdered inside the museum, his body covered in baffling symbols. As Langdon and gifted French cryptologist Sophie Neveu sort through the bizarre riddles, they are stunned to discover a trail of clues hidden in the works of Leonardo da Vinci—clues visible for all to see and yet ingeniously disguised by the painter.Even more startling, the late curator was involved in the Priory of Sion—a secret society whose members included Sir Isaac Newton, Victor Hugo, and Da Vinci—and he guarded a breathtaking historical secret. Unless Langdon and Neveu can decipher the labyrinthine puzzle—while avoiding the faceless adversary who shadows their every move—the explosive, ancient truth will be lost forever. ...more"], "price": 22.96},
{"url": "https://books.toscrape.com/catalogue/seven-days-in-the-art-world_220/index.html", "title": "Seven Days in the Art World", "upc": "0", "product_type": "books", "price_excl_tax": 52.33, "price_incl_tax": 52.33, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Two", "category": "add a comment", "description": ["Named one of the best art books of 2008 by The New York Times and The Sunday Times [London]: “An indelible portrait of a peculiar society.”—Vogue The art market has been booming. Museum attendance is surging. More people than ever call themselves artists. Contemporary art has become a mass entertainment, a luxury good, a job description, and, for some, a kind of alternativ Named one of the best art books of 2008 by The New York Times and The Sunday Times [London]: “An indelible portrait of a peculiar society.”—Vogue The art market has been booming. Museum attendance is surging. More people than ever call themselves artists. Contemporary art has become a mass entertainment, a luxury good, a job description, and, for some, a kind of alternative religion. In a series of beautifully paced narratives, Sarah Thornton investigates the drama of a Christie's auction, the workings in Takashi Murakami's studios, the elite at the Basel Art Fair, the eccentricities of Artforum magazine, the competition behind an important art prize, life in a notorious art-school seminar, and the wonderland of the Venice Biennale. She reveals the new dynamics of creativity, taste, status, money, and the search for meaning in life. A judicious and juicy account of the institutions that have the power to shape art history, based on hundreds of interviews with high-profile players, Thornton's entertaining ethnography will change the way you look at contemporary culture. 8 illustrations. ...more"], "price": 52.33},
{"url": "https://books.toscrape.com/catalogue/notes-from-a-small-island-notes-from-a-small-island-1_200/index.html", "title": "Notes from a Small Island (Notes From a Small Island #1)", "upc": "c", "product_type": "books", "price_excl_tax": 40.17, "price_incl_tax": 40.17, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating One", "category": "nonfiction", "description": ["\"Suddenly, in the space of a moment, I realized what it was that I loved about Britain-which is to say, all of it.\" After nearly two decades spent on British soil, Bill Bryson - bestselling author of The Mother Tongue and Made in America-decided to return to the United States. (\"I had recently read,\" Bryson writes, \"that 3.7 million Americans believed that they had been a \"Suddenly, in the space of a moment, I realized what it was that I loved about Britain-which is to say, all of it.\" After nearly two decades spent on British soil, Bill Bryson - bestselling author of The Mother Tongue and Made in America-decided to return to the United States. (\"I had recently read,\" Bryson writes, \"that 3.7 million Americans believed that they had been abducted by aliens at one time or another,so it was clear that my people needed me.\") But before departing, he set out on a grand farewell tour of the green and kindly island that had so long been his home.Veering from the ludicrous to the endearing and back again, Notes from a Small Island is a delightfully irreverent jaunt around the unparalleled floating nation that has produced zebra crossings, Shakespeare, Twiggie Winkie's Farm, and places with names like Farleigh Wallop and Titsey. The result is an uproarious social commentary that conveys the true glory of Britain, from the satiric pen of an unapologetic Anglophile. ...more"], "price": 40.17},
{"url": "https://books.toscrape.com/catalogue/jurassic-park-jurassic-park-1_180/index.html", "title": "Jurassic Park (Jurassic Park #1)", "upc": "a", "product_type": "books", "price_excl_tax": 44.97, "price_incl_tax": 44.97, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating One", "category": "fiction", "description": ["A billionaire has created a technique to clone dinosaurs. From the DNA that his crack team of scientists extract, he is able to grow the dinosaurs in his laboratories and lock them away on an island behind electric fences, creating a sort of theme park. He asks a group of scientists from several different fields to come and view the park, but something goes terribly wrong A billionaire has created a technique to clone dinosaurs. From the DNA that his crack team of scientists extract, he is able to grow the dinosaurs in his laboratories and lock them away on an island behind electric fences, creating a sort of theme park. He asks a group of scientists from several different fields to come and view the park, but something goes terribly wrong when a worker on the island turns traitor and shuts down the power.Cover illustration by Chip Kidd. ...more"], "price": 44.97},
{"url": "https://books.toscrape.com/catalogue/girl-in-the-blue-coat_160/index.html", "title": "Girl in the Blue Coat", "upc": "4", "product_type": "books", "price_excl_tax": 46.83, "price_incl_tax": 46.83, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Two", "category": "historical fiction", "description": ["Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to th Amsterdam, 1943. Hanneke spends her days finding and delivering sought-after black market goods to paying customers, nights hiding the true nature of her work from her concerned parents, and every waking moment mourning her boyfriend, who was killed on the Dutch front lines when the German army invaded. Her illegal work keeps her family afloat, and Hanneke also likes to think of it as a small act of rebellion against the Nazis.On a routine delivery, a client asks Hanneke for help. Expecting to hear that Mrs. Janssen wants meat or kerosene, Hanneke is shocked by the older woman’s frantic plea to find a person: a Jewish teenager Mrs. Janssen had been hiding, who has vanished without a trace from a secret room. Hanneke initially wants nothing to do with such a dangerous task but is ultimately drawn into a web of mysteries and stunning revelations—where the only way out is through.Beautifully written, intricately plotted, and meticulously researched, Girl in the Blue Coat is an extraordinary, unforgettable story of bravery, grief, and love in impossible times. ...more"], "price": 46.83},
{"url": "https://books.toscrape.com/catalogue/civilization-and-its-discontents_140/index.html", "title": "Civilization and Its Discontents", "upc": "3", "product_type": "books", "price_excl_tax": 59.95, "price_incl_tax": 59.95, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Two", "category": "psychology", "description": ["It stands as a brilliant summary of the views on culture from a psychoanalytic perspective that he had been developing since the turn of the century. It is both witness and tribute to the late theory of mind—the so-called structural theory, with its stress on aggression, indeed the death drive, as the pitiless adversary of eros.Civilization and Its Discontents is one of th It stands as a brilliant summary of the views on culture from a psychoanalytic perspective that he had been developing since the turn of the century. It is both witness and tribute to the late theory of mind—the so-called structural theory, with its stress on aggression, indeed the death drive, as the pitiless adversary of eros.Civilization and Its Discontents is one of the last of Freud's books, written in the decade before his death and first published in German in 1929. In it he states his views on the broad question of man's place in the world, a place Freud defines in terms of ceaseless conflict between the individual's quest for freedom and society's demand for conformity.Freud's theme is that what works for civilization doesn't necessarily work for man. Man, by nature aggressive and egotistical, seeks self-satisfaction. But culture inhibits his instinctual drives. The result is a pervasive and familiar guilt.Of the various English translations of Freud's major works to appear in his lifetime, only one was authorized by Freud himself: The Standard Edition of the Complete Psychological Works of Sigmund Freud under the general editorship of James Strachey.Freud approved the overall editorial plan, specific renderings of key words and phrases, and the addition of valuable notes, from bibliographical and explanatory. Many of the translations were done by Strachey himself; the rest were prepared under his supervision. The result was to place the Standard Edition in a position of unquestioned supremacy over all other existing versions. ...more"], "price": 59.95},
{"url": "https://books.toscrape.com/catalogue/annie-on-my-mind_120/index.html", "title": "Annie on My Mind", "upc": "7", "product_type": "books", "price_excl_tax": 36.83, "price_incl_tax": 36.83, "tax": 0.0, "availability": 3, "num_reviews": 0, "stars": "star-rating Five", "category": "young adult", "description": ["This groundbreaking book is the story of two teenage girls whose friendship blossoms into love and who, despite pressures from family and school that threaten their relationship, promise to be true to each other and their feelings. This book is so truthful and honest, it has been banned from many school libraries and even publicly burned in Kansas City.Of the author and th This groundbreaking book is the story of two teenage girls whose friendship blossoms into love and who, despite pressures from family and school that threaten their relationship, promise to be true to each other and their feelings. This book is so truthful and honest, it has been banned from many school libraries and even publicly burned in Kansas City. Of the author and the book, the Margaret A. Edwards Award committee said, “Nancy Garden has the distinction of being the first author for young adults to create a lesbian love story with a positive ending. Using a fluid, readable style, Garden opens a window through which readers can find courage to be true to themselves.” ...more"], "price": 36.83},
{"url": "https://books.toscrape.com/catalogue/fruits-basket-vol-2-fruits-basket-2_100/index.html", "title": "Fruits Basket, Vol. 2 (Fruits Basket #2)", "upc": "c", "product_type": "books", "price_excl_tax": 11.64, "price_incl_tax": 11.64, "tax": 0.0, "availability": 2, "num_reviews": 0, "stars": "star-rating Five", "category": "sequential art", "description": ["A family with an ancient curse...And the girl who will change their lives forever...Ever since Tohru Honda discovered the Zodiac secret of the Sohma clan, her eyes have opened to a world of magic and wonder. But with such a great secret comes great responsibility. When her best friends Hana-chan and Uo-chan come to the Sohma home for a sleepover, Tohru has her work cut out A family with an ancient curse...And the girl who will change their lives forever...Ever since Tohru Honda discovered the Zodiac secret of the Sohma clan, her eyes have opened to a world of magic and wonder. But with such a great secret comes great responsibility. When her best friends Hana-chan and Uo-chan come to the Sohma home for a sleepover, Tohru has her work cut out for her keeping the \"Cat\" in the bag and the \"Dog\" on a leash. ...more"], "price": 11.64},
{"url": "https://books.toscrape.com/catalogue/the-secret-healer_80/index.html", "title": "The Secret Healer", "upc": "3", "product_type": "books", "price_excl_tax": 34.56, "price_incl_tax": 34.56, "tax": 0.0, "availability": 1, "num_reviews": 0, "stars": "star-rating Three", "category": "historical fiction", "description": ["In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s c In the fourteenth century, opportunities for women are limited to the home. But spirited young Madlen finds her calling as assistant to the city’s trusted midwife, Clara. Working alongside Clara, Madlen develops a surprisingly soothing technique and quickly becomes a talented healer.After Clara’s tragic death, Madlen alone rushes to assist the birth of a local nobleman’s child. But rather than the joy of birth, Madlen walks into an accusation of murder and witchcraft because of her extraordinary gifts. Forced to flee her own town, she establishes a new identity in the home of her aunt. Yet even though it endangers her life, she cannot resist the urge to help the sick patients who seek out her miraculous treatment. When she meets handsome Johannes—an investigator hired by the Church to bring her to justice for sacrilegious acts—she becomes drawn to the very man who could destroy her.Will Madlen’s gifts bring about her downfall? Or can love and reason prevail in a time of fearful superstition? ...more"], "price": 34.56},
{"url": "https://books.toscrape.com/catalogue/the-bhagavad-gita_60/index.html", "title": "The Bhagavad Gita", "upc": "f", "product_type": "books", "price_excl_tax": 57.49, "price_incl_tax": 57.49, "tax": 0.0, "availability": 1, "num_reviews": 0, "stars": "star-rating Three", "category": "religion", "description": ["The Bhagavad Gita is an intensely spiritual work that forms the cornerstone of the Hindu faith, and is also one of the masterpieces of Sanskrit poetry. It describes how, at the beginning of a mighty battle between the Pandava and Kaurava armies, the god Krishna gives spiritual enlightenment to the warrior Arjuna, who realizes that the true battle is for his own soul.Juan M The Bhagavad Gita is an intensely spiritual work that forms the cornerstone of the Hindu faith, and is also one of the masterpieces of Sanskrit poetry. It describes how, at the beginning of a mighty battle between the Pandava and Kaurava armies, the god Krishna gives spiritual enlightenment to the warrior Arjuna, who realizes that the true battle is for his own soul.Juan Mascaró's translation of The Bhagavad Gita captures the extraordinary aural qualities of the original Sanskrit. This edition features a new introduction by Simon Brodbeck, which discusses concepts such as dehin, prakriti and karma. ...more"], "price": 57.49},
{"url": "https://books.toscrape.com/catalogue/on-the-road-duluoz-legend_40/index.html", "title": "On the Road (Duluoz Legend)", "upc": "9", "product_type": "books", "price_excl_tax": 32.36, "price_incl_tax": 32.36, "tax": 0.0, "availability": 1, "num_reviews": 0, "stars": "star-rating Three", "category": "default", "description": ["On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, \"a sideburned hero of the snowy West.\" As \"Sal Paradise\" and \"Dean Moriarty,\" the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the On the Road chronicles Jack Kerouac's years traveling the North American continent with his friend Neal Cassady, \"a sideburned hero of the snowy West.\" As \"Sal Paradise\" and \"Dean Moriarty,\" the two roam the country in a quest for self-knowledge and experience. Kerouac's love of America, his compassion for humanity, and his sense of language as jazz combine to make On the Road an inspirational work of lasting importance.Kerouac's classic novel of freedom and longing defined what it meant to be \"Beat\" and has inspired every generation since its initial publication. ...more"], "price": 32.36},
{"url": "https://books.toscrape.com/catalogue/frankenstein_20/index.html", "title": "Frankenstein", "upc": "a", "product_type": "books", "price_excl_tax": 38.0, "price_incl_tax": 38.0, "tax": 0.0, "availability": 1, "num_reviews": 0, "stars": "star-rating Two", "category": "default", "description": ["Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles Mary Shelley began writing Frankenstein when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, Frankenstein tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles a human being from stolen body parts but; upon bringing it to life, he recoils in horror at the creature's hideousness. Tormented by isolation and loneliness, the once-innocent creature turns to evil and unleashes a campaign of murderous revenge against his creator, Frankenstein.Frankenstein, an instant bestseller and an important ancestor of both the horror and science fiction genres, not only tells a terrifying story, but also raises profound, disturbing questions about the very nature of life and the place of humankind within the cosmos: What does it mean to be human? What responsibilities do we have to each other? How far can we go in tampering with Nature? In our age, filled with news of organ donation genetic engineering, and bio-terrorism, these questions are more relevant than ever. ...more"], "price": 38.0}
]